Repository: gros-pataplouf/portfolio
Catalog: portfolio/locale/*/LC_MESSAGES/django.po
Languages: de, fr

source: I would love to receive a real message ;) Please.
de: Ich würde mich total über eine echte Nachricht freuen :) Danke
fr: Je serais ravie de recevoir un véritable message. S'il vous plaît.

source: Your email
de: Ihre E-Mail-Adresse
fr: Votre courriel

source: Your email address
de: Ihre E-Mail-Adresse
fr: Votre courriel

source: Your message
de: Ihre Nachricht
fr: Votre message

source: Languages
de: Programmiersprachen
fr: Langages

source: Databases
de: Datenbanken
fr: Bases de données

source: Other
de: Sonstiges
fr: Autre

source: Projects
de: Projekte
fr: Projets

source: Switch to English
de: Englisch
fr: Afficher en anglais

source: Switch to German
de: Deutsch
fr: Afficher en allemand

source: Switch to French
de: Französisch
fr: Afficher en français

source: Contact
de: Kontakt

source: Call me
de: Anrufen
fr: Appeler

source: Send me an email
de: E-Mail senden
fr: Envoyer un courriel

source: Who I am
de: Über mich

source: I'm a self-taught programmer
de: Ich bin Webentwicklerin, Autodidaktin

source: and passionnate problem-solver.
de: und begeisterte Problemlöserin.

source: Curiosity, languages and code spark joy.
de: Als Gernelernerin habe ich mich nach meiner ersten Karriere als Lehrerin neu erfunden.

source: Structures and patterns of natural and programming languages have been my livelong passion. I still remember the thrill I felt solving the newspaper's cryptogram puzzle in my head as a little child, a fascination that came back when I took up Python during the pandemic. Yet, my desire to build bridges between people and cultures made me study French and Italian. After 6 years as a teacher in the French school system, I decided to take a sabbatical and work and live in Ireland. When I came back from Ireland, going back to my teaching career was not an option: there was so much more to learn and to discover.
de: Strukturen und Muster begeistern mich seit Kindesbeinen, ganz gleich, ob es sich um lebende Sprachen, Code oder Rätsel handelt. Mein Wunsch, Brücken zwischen Menschen und Kulturen zu schlagen, ließ mich zunächst Romanistik studieren. Nach 6 Jahren im französischen Schulsystem beschloss ich, eine Auszeit zu nehmen. Ein mehrmonatiger Sprach- und Arbeitsaufenthalt in Irland machte mir klar, dass meine Reise nicht im Klassenzimmer enden würde. Es gab noch so viel mehr zu lernen und zu entdecken.

source: I love helping people solve problems.
de: Ich liebe es, Menschen zu helfen, Probleme zu lösen.

source: Back to the Swiss-French border region, I got closer to technology by working for a Technical and Medical Assistance provider. While working the phone lines in four languages to get Swiss customers in emergency situation safely home, I also learned HTML and CSS to help agents with a clickable decision trees for the browser-based softphone. Today, I'm responsible for optimizing, documenting and developing new features for a phone system with 400+ users and 300+ incoming lines. Whatever I do is focused on helping the customer, end-users and team-members.
de: Nach meiner Rückkehr ins das französisch-schweizerische Grenzland kam ich Themen näher, die mir Spass machten. Während ich in vier Sprachen Telefonate führte, um Schweizer Kunden in Notlagen sicher nach Hause zu bringen, lernte ich auch HTML und CSS, um den Mitarbeitern mit interaktiven Entscheidungsbäumen für das browserbasierte Softphone zu helfen. Heute kümmere ich mich um die Optimierung, Dokumentation und Weiterentwicklung einer Telefonanlage mit über 400 Benutzern und 300 eingehenden Leitungen. Ganz gleich, was ich tue: der Kunde oder Nutzer steht bei mir immer im Mittelpunkt.

source: Community matters.
de: Code passiert in der Community.

source: As a self-taught developer, I have found a vital and supportive network in the tech community. Local React meetups as well as pair programming and practising TDD with Ladies of Code London have been an important for feedback and a change of perspective. I'm giving back to the community by volunteering and currently searching for occasions to Open Source projects with Django.
de: Als Autodidaktin habe ich unglaublich viel Unterstützung durch die Tech-Community erfahren. Lokale Tech-Meetups oder Pair Programming und TDD mit den Ladies of Code London sind für mich stets eine Gelegenheit für Feedback, Austausch und Perspektivwechsel. Als Freiwillige beteilige ich mich der Organisation von Programmierworkshops und suche derzeit nach Open Source Django-Projekten.

source: Let's work together!
de: Kontaktformular
fr: N'hésitez pas à me contacter !

source: Send
de: Senden
fr: Envoyer

source: Hi, I'm Cornelia!
de: Willkommen!
fr: Bienvenue !

source: I'm a
de: Ich bin Cornelia,

source: Full-Stack Developer
de: Full-Stack Entwicklerin
fr: Développeuse Full-Stack

source: with a strong focus on
de: mit Schwerpunkt
fr: , je me suis spécialisée sur

source: and
de: und
fr: et

source: Searching an
de: Ich suche
fr: Je suis à la recherche d'un

source: entry-level position
de: eine Einstiegsmöglichkeit
fr: premier poste

source: as a
de: als
fr: en tant que

source: Backend or Full-Stack Webdeveloper
de: Backend oder Full-Stack-Entwicklerin
fr: développeuse back-end ou fullstack

source: Immediately available part-time, full-time within a 3 months' notice.
de: Teilzeit sofort einsatzbereit, Vollzeit drei Monate Vorlaufzeit.
fr: Disponible immédiatement à temps partiel, à temps plein avec un préavis de 3 mois.

source: Based near Hamburg, happy to relocate, remote or hybrid preferred.
de: Großraum Hamburg, geografisch mobil mit Präferenz für remotes oder hybrides Arbeiten.
fr: Basée près de Hambourg, géographiquement mobile, préférence pour le télétravail.

source: Looking for
de: Immer freue ich mich darüber, mich in
fr: A la recherche de

source: open-source collaborations and volunteer opportunities
de: Open-Source Projekten und ehrenamtlich einzubringen
fr: collaborations open-source et d'opportunités de volontariat

source: causes: human rights, zero waste, biodiversity
de: gerne rund um die Themen Menschenrechte, Zero Waste, Naturschutz
fr: causes: droits de l'homme, zéro déchet, biodiversité

source: See projects
de: Projekte

source: Check out my projects.
de: Web-Projekte
fr: Quelques projets web,

source: Filter by skill
de: nach Skill filtern
fr: à filter par compétence

source: Thank you
de: Danke
fr: Merci

source: English
de: Englisch
fr: Anglais

source: German
de: Deutsch
fr: Allemand

source: French
de: Französisch
fr: Français

source: Home
fr: Accueil

source: Bio
fr: A propos

source: Skills
fr: Expertise
